export interface FAQItem {
  question: string;
  answer: string;
}

export interface FAQTranslations {
  title: string;
  bottomText: string;
  buttonText: string;
  faq: FAQItem[];
}

export type FAQData = {
  ru: FAQTranslations;
  kgz: FAQTranslations;
};

export const faqData: FAQData = {
  ru: {
    title: "Ответы на вопросы",
    bottomText:
      "Если у вас еще остались вопросы, отправьте нам заявку и мы с вами свяжемся",
    buttonText: "Отправить заявку",
    faq: [
      {
        question: "Каким может быть доход?",
        answer:
          "Финальный заработок водителя зависит от региона и от графика работы. С Яндекс Такси можно как подрабатывать всего несколько часов в неделю, так и выполнять заказы каждый день. И для водителей в сервисе есть свои бонусы. С доходом всё прозрачно. В разделе «Заработок» в Яндекс Про можно проверить список всех поездок и детальную информацию по каждой: маршрут, стоимость, бонусы. Пассажиры будут платить вам как наличными, так и картой. И порой оставлять чаевые :)",
      },
      {
        question: "Можно ли выбрать условия работы?",
        answer:
          "Да, можно подрабатывать, выполняя заказы только в часы пик, или провести на линии целый рабочий день — решать вам. А ещё Яндекс Про подсветит для вас фиолетовым зоны, где спрос на поездки выше, и предложит заказы по пути домой в конце смены, чтобы вы не тратили бензин вхолостую.",
      },
      {
        question: "Какую лучше взять машину для работы?",
        answer:
          "Все зависит от того, в каком тарифе вы хотите выполнять заказы. Мы учитываем модель, год выпуска машины и её среднерыночную стоимость. Для работы подходят только автомобили, у которых не меньше 4 дверей.",
      },
      {
        question: "А как получать заказы от Яндекс.Такси?",
        answer:
          "Начать работу водителем с сервисом Яндекс Такси очень просто. Вам понадобится смартфон с операционной системой Android 5.0, камерой, GPS-модулем и 2 ГБ оперативной памяти. Скачайте и установите приложение Яндекс Про. Оно будет предлагать вам заказы, прокладывать маршрут, рассчитывать цену поездки и держать в курсе всех новостей сервиса. Вам не придётся искать себе пассажиров или думать о том, как лучше проехать — можно сосредоточиться на заказах.",
      },
      {
        question: "Как распределяются заказы между водителями?",
        answer:
          "Обратиться за помощью можно через Яндекс Про — приложение для получения заказов. К тому же жизнь и здоровье водителя и пассажиров застрахованы на время поездки.",
      },
    ],
  },

  kgz: {
    title: "Суроолорго жооптор",
    bottomText:
      "Эгерде сизде дагы суроолор болсо, бизге өтүнмө жибериңиз, биз сиз менен байланышабыз",
    buttonText: "Өтүнмө жиберүү",
    faq: [
      {
        question: "Киреше канча болушу мүмкүн?",
        answer:
          "Айдоочунун акыркы кирешеси регионго жана иш графигине жараша болот. Яндекс Такси менен жума сайын бир нече саат гана иштеп кошумча киреше табууга же ар күнү тапшырыктарды аткарууга болот. Айдоочулар үчүн кызматта кошумча бонус да каралган. Киреше толук ачык көрсөтүлөт: Яндекс Про колдонмосунда «Киреше» бөлүмүндө бардык жүргөн каттамдардын тизмесин жана ар биринин майда-чүйдөсүн — маршрут, баа, бонус — көрүүгө болот. Кардарлар акчаны накталай же карта менен төлөшөт, кээде чайпул да калтырышат :)",
      },
      {
        question: "Иш шарттарын тандоого болобу?",
        answer:
          "Ооба, сиз кааласаңыз, жогорку суроо-талап учурунда гана иштей аласыз же толук күн бою линияга чыгып иштөөнү тандай аласыз — тандоо сизде. Мындан тышкары, Яндекс Про колдонмосу суроо-талап жогору болгон аймактарды кызгылт көк түстө көрсөтүп, смена аяктап бара жатканда үй тарапка багытталган тапшырыктарды сунуштайт, бул бензинди үнөмдөөгө жардам берет.",
      },
      {
        question: "Иштөө үчүн кайсы унаа ылайыктуу?",
        answer:
          "Бул сиз кайсы тариф менен иштөөнү каалаганыңызга жараша болот. Биз унаанын модели, чыгарылган жылы жана орточо базар баасын эске алабыз. Иштөө үчүн 4 эшиги бар унаалар гана жарактуу.",
      },
      {
        question: "Яндекс.Таксиден кантип тапшырык алса болот?",
        answer:
          "Яндекс Такси кызматында айдоочу болуп иштөөнү баштоо өтө эле жөнөкөй. Android 5.0 системасы бар, камерасы жана GPS модулу бар смартфон керек (кеминде 2 ГБ оперативдүү эс тутум менен). Яндекс Про колдонмосун жүктөп орнотуңуз — ал сизге тапшырыктарды сунуштап, маршрут түзүп, бааны эсептеп жана кызмат боюнча жаңылыктарды көрсөтүп турат. Кардар издөөнүн же маршрут пландаштыруунун кереги жок — сиз жөн гана тапшырыктарды аткара бересиз.",
      },
      {
        question: "Тапшырыктар айдоочулар арасында кантип бөлүштүрүлөт?",
        answer:
          "Жардам алуу үчүн Яндекс Про колдонмосун пайдалансаңыз болот — бул тапшырыктарды кабыл алуу колдонмосу. Мындан тышкары, айдоочунун жана жүргүнчүлөрдүн өмүрү менен саламаттыгы ар бир жүрүш маалында камсыздандырылган.",
      },
    ],
  },
};
