
interface FAQItem {
  question: string;
  answer: string;
}

export const faqData: FAQItem[] = [
  {
    "question": "Каким может быть доход?",
    "answer": "Финальный заработок водителя зависит от региона и от графика работы. С Яндекс Такси можно как подрабатывать всего несколько часов в неделю, так и выполнять заказы каждый день. И для водителей в сервисе есть свои бонусы. С доходом всё прозрачно. В разделе «Заработок» в Яндекс Про можно проверить список всех поездок и детальную информацию по каждой: маршрут, стоимость, бонусы. Пассажиры будут платить вам как наличными, так и картой. И порой оставлять чаевые :)"
  },
  {
    "question": "Можно ли выбрать условия работы?",
    "answer": "Да, можно подрабатывать, выполняя заказы только в часы пик, или провести на линии целый рабочий день — решать вам. А ещё Яндекс Про подсветит для вас фиолетовым зоны, где спрос на поездки выше, и предложит заказы по пути домой в конце смены, чтобы вы не тратили бензин вхолостую."
  },
  {
    "question": "Какую лучше взять машину для работы?",
    "answer": "Все зависит от того, в каком тарифе вы хотите выполнять заказы. Мы учитываем модель, год выпуска машины и её среднерыночную стоимость. Для работы подходят только автомобили, у которых не меньше 4 дверей."
  },
  {
    "question": "А как получать заказы от Яндекс.Такси?",
    "answer": "Начать работу водителем с сервисом Яндекс Такси очень просто. Вам понадобится смартфон с операционной системой Android 5.0, камерой, GPS-модулем и 2 ГБ оперативной памяти. Скачайте и установите приложение Яндекс Про. Оно будет предлагать вам заказы, прокладывать маршрут, рассчитывать цену поездки и держать в курсе всех новостей сервиса. Вам не придётся искать себе пассажиров или думать о том, как лучше проехать — можно сосредоточиться на заказах."
  },
  {
    "question": "Как распределяются заказы между водителями?",
    "answer": "Обратиться за помощью можно через Яндекс Про — приложение для получения заказов. К тому же жизнь и здоровье водителя и пассажиров застрахованы на время поездки."
  }
];
